Examinator/src/InformationRegisters/ЛичныеСообщенияПользователейСУО/ЛичныеСообщенияПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛичныеСообщенияПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ОтправительИлиПолучатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГрупповоеОбсуждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправленное</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиЛичныхСообщенийСУО/НастройкиЛичныхСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЛичныхСообщенийСУО</name>
  <attributes>
    <name>Удалено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиТемОбщенияСУО/НастройкиТемОбщенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТемОбщенияСУО</name>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ЛичныеСообщенияПользователейСУО/Forms/ЛичныеСообщения/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Процедура ЗаписатьНастройкиСообщения(Сообщение, ИмяНастройки=Неопределено, ЗначениеНастройки=Неопределено)
	
	НачатьТранзакцию();
	
	РегистрыСведений.НастройкиЛичныхСообщенийСУО.ЗаписатьНастройки(Сообщение, ИмяНастройки, ЗначениеНастройки);
	РегистрыСведений.НастройкиТемОбщенияСУО.ЗаписатьНастройки(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сообщение, "Тема"));
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция ПолучитьТекстСообщения(Сообщение)
	
    ЗаписатьНастройкиСообщения(Сообщение);
	
	// Получаем данные сообщения
	
	ДанныеСообщения = Документы.СообщениеСУО.ДанныеТелаСообщения(Сообщение);
	
	Возврат ДанныеСообщения;
	
КонецФункции

&НаСервере
Процедура ПоказатьСообщение(Сообщение=Неопределено)
	
	// Примечание: функция размещена на сервере, так как при 
	// Размещении на клиенте, не работают картинки.
	
	ФайлыСообщения.Очистить();
	ТекстСообщения = Неопределено;
	
	Если ЗначениеЗаполнено(Сообщение) Тогда
	
		ДанныеСообщения = ПолучитьТекстСообщения(Сообщение);
			
		ТекстСообщения = ДанныеСообщения.ФорматированныйДокумент;
		
		Для каждого ЗначениеСписка Из ДанныеСообщения.Файлы Цикл
		
			НоваяСтрока = ФайлыСообщения.Добавить();
			НоваяСтрока.Наименование = ЗначениеСписка.Представление;
			НоваяСтрока.Файл         = ЗначениеСписка.Значение;
		
		КонецЦикла;
		
		Элементы.Сообщения.Обновить();
		
	КонецЕсли;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем переменные и параметры
	
	Сообщения.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.ТекущийПользователь());
	
	// Формируем дерево групп сообщений
	
	ДеревоГрупп = Новый ДеревоЗначений();
	ДеревоГрупп.Колонки.Добавить("Группа");
	ДеревоГрупп.Колонки.Добавить("Наименование");
	ДеревоГрупп.Колонки.Добавить("Картинка");
	
	НоваяСтрока = ДеревоГрупп.Строки.Добавить();
	НоваяСтрока.Группа = "Входящие";
	НоваяСтрока.Наименование = "Входящие";
	НоваяСтрока.Картинка = 1;

	НоваяСтрока = ДеревоГрупп.Строки.Добавить();
	НоваяСтрока.Группа = "Отправленные";
	НоваяСтрока.Наименование = "Отправленные";
	НоваяСтрока.Картинка = 2;
	
	НоваяСтрока = ДеревоГрупп.Строки.Добавить();
	НоваяСтрока.Группа = "Корзина";
	НоваяСтрока.Наименование = "Корзина";
	НоваяСтрока.Картинка = 6;
	
	ЗначениеВРеквизитФормы(ДеревоГрупп, "ГруппыСообщений");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписаноСообщениеОбсуждения" Тогда
		Элементы.Сообщения.Обновить();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура Написать(Команда)
	ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", Новый Структура("Кому", "Пользователю"));
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Сообщения.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекущиеДанные = Элементы.Сообщения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;

	ЗаписатьНастройкиСообщения(ТекущиеДанные.Сообщение, "Удалено", Истина);
	
	Элементы.Сообщения.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура Ответить(Команда)
	
	ТекущиеДанные = Элементы.Сообщения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("РодительскоеСообщение", ТекущиеДанные.Сообщение);

	ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВсяПереписка(Команда)
	
	ТекущиеДанные = Элементы.Сообщения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;

	ОткрытьФорму("ОбщаяФорма.ОбщениеСУО", Новый Структура("Тема", ТекущиеДанные.Тема));

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Сообщения

&НаКлиенте
Процедура СообщенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;

	ПоказатьЗначение(,ТекущиеДанные.Сообщение);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	ФайлыСообщения.Очистить();
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ПоказатьСообщение();
		
	Иначе
		
		Если ТекущиеДанные.Сообщение <> ПоследнееВыбранноеСообщение Тогда // Чтобы избежать бесконечной рекурсии
			ПоследнееВыбранноеСообщение = ТекущиеДанные.Сообщение;
			ПоказатьСообщение(ТекущиеДанные.Сообщение);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Группы

&НаКлиенте
Процедура ГруппыСообщенийПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Сообщения.Отбор, "Группа", NULL);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Сообщения.Отбор, "Группа", ТекущиеДанные.Группа);
	КонецЕсли;
	
	Если Элементы.Сообщения.ТекущиеДанные = Неопределено Тогда
		ПоказатьСообщение();
	Иначе
		Если Элементы.Сообщения.ТекущиеДанные.Сообщение <> ПоследнееВыбранноеСообщение Тогда // Чтобы избежать бесконечной рекурсии
			ПоследнееВыбранноеСообщение = Элементы.Сообщения.ТекущиеДанные.Сообщение;
			ПоказатьСообщение(Элементы.Сообщения.ТекущиеДанные.Сообщение);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ФайлыСообщения

&НаКлиенте
Процедура ФайлыСообщенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(ТекущиеДанные.Файл, УникальныйИдентификатор);
	
	ПрисоединенныеФайлыКлиент.ОткрытьФайл(ДанныеФайла);

КонецПроцедуры
